orgblog/me.org
#+TITLE: About
#+DATE: <2026-03-27 Fri>
#+SUBTITLE:
#+OPTIONS: H:1 toc:nil num:nil

* What have you worked on?

I'm a former academic, programming language researcher, compiler engineer,
systems programmer and tinkerer. You can find my linkedin [[https://www.linkedin.com/in/jeffrey-young-ph-d-17b97566][here]].

* How to contact you?

I'm on the job market at the moment. You can reach me at jeff at pure-systems.org

* Why "doyougnu" for everything online?

My legal name =Jeffrey M. Young= is extremely common, so I resort to a pseudonym.
