me.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 29 April 2026 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About</title>
<meta name="author" content="doyougnu" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
<div id="content" class="content">
<h1 class="title">About</h1>
<div id="outline-container-org8894658" class="outline-2">
<h2 id="org8894658">What have you worked on?</h2>
<div class="outline-text-2" id="text-org8894658">
<p>
I&rsquo;m a former academic, programming language researcher, compiler engineer,
systems programmer and tinkerer. You can find my linkedin <a href="https://www.linkedin.com/in/jeffrey-young-ph-d-17b97566">here</a>.
</p>
</div>
</div>
<div id="outline-container-org42e5dd0" class="outline-2">
<h2 id="org42e5dd0">How to contact you?</h2>
<div class="outline-text-2" id="text-org42e5dd0">
<p>
I&rsquo;m on the job market at the moment. You can reach me at jeff at pure-systems.org
</p>
</div>
</div>
<div id="outline-container-orgcc3c4c9" class="outline-2">
<h2 id="orgcc3c4c9">Why &ldquo;doyougnu&rdquo; for everything online?</h2>
<div class="outline-text-2" id="text-orgcc3c4c9">
<p>
My legal name <code>Jeffrey M. Young</code> is extremely common, so I resort to a pseudonym.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr>
               <div class='author-info' style='text-align:center; margin-top: 2em; font-style: italic;'>
                 Written by <a href='/me.html' class='author-link'>doyougnu</a>
                 on <span class='timestamp'>27 March 2026</span>
               </div>
               <div class='botnav' style='text-align:center; margin-top: 2em;'>
                  <a href='/index.html'>Blog</a>
                  <a href='/publications.html'>Publications</a>
                  <a href='https://github.com/doyougnu'>Github</a>
                  <a href='/me.html'>About</a>
               </div>
</div>
</body>
</html>
